app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("encrypted_password", "created_at", "peoplesoft_num", "updated_at", "password_salt", "brother_status", "last_name", "first_name", "email") VALUES('fc17d64afe8bbd6b6d5cc2659be7a89937e2db14e4f07514e128112733634005', '2011-05-17 06:29:10', '1234567', '2011-05-17 06:29:10', '1a8cd62aff4cd966fe89c9e26ae99fb612c3e87259b4f5c81b86cb4ca3d1eac4', NULL, 'San', 'Ginotwo', 'poper87@email.com')